"""
====================================================

VertDev

Все настройки программы находятся здесь.

====================================================
"""

# ==============================
# Файлы
# ==============================

DXF_FILE = "data/pylons.dxf"
SURVEY_FILE = "data/survey.txt"
OUTPUT_FILE = "result.dxf"

# ==============================
# Поиск точек
# ==============================

SEARCH_MARGIN = 0.35      # метров

# ==============================
# Текст
# ==============================

TEXT_HEIGHT = 0.05        # м
TEXT_WIDTH = 1.0

TOP_TEXT = "В"
BOTTOM_TEXT = "Н"

# ==============================
# Стрелки
# ==============================

ARROW_LENGTH = 0.10       # м
ARROW_SIZE = 0.015        # размер наконечника

WALL_OFFSET = 0.06        # от стены до стрелки
TEXT_OFFSET = 0.02        # от стрелки до текста

# ==============================
# Расстояния между стрелками
# ==============================

PAIR_SPACING = 0.07

LONG_SIDE_SPACING = 0.25

END_SIDE_SPACING = 0.25

# ==============================
# Слой
# ==============================

OUTPUT_LAYER = "VERTDEV"

# ==============================
# Цвета
# ==============================

TOP_COLOR = 1      # красный
BOTTOM_COLOR = 3   # зелёный

ARROW_COLOR = 5

